# MetalF0 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedMetal..::..MetalF0 Property
AdvancedMetal Class See Also
---
The property labeled "Reflectance" from the "AdvancedMetal" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetalF0 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetalF0 As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetalF0 {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
AdvancedMetal Class
Autodesk.Revit.DB.Visual Namespace